package org.itstep;
/*10. Таксопарк. Определить иерархию легковых автомобилей. Создать таксо-
        парк. Подсчитать стоимость автопарка. Провести сортировку автомобилей
        парка по расходу топлива. Найти автомобиль в компании, соответствую-
        щий заданному диапазону параметров скорости.*/
public class Homework7 {
// Я за ранее извиняюсь, что так задерживаю выполнения ДЗ
    // В данный момент на работе выполняю(учусь) локализацию готового программного продукта "INTERNAL AUDIT MANAGEMENT SYSTEM" с использованием Primefaces 6.1

}
